# -*- coding: utf-8 -*-
"""
Завдання 5.4

Запросити користувача введення IP-адреси у форматі: 10.1.1.1

Потім вивести інформацію про адресу у такому форматі:
10        1         1         1
00001010  00000001  00000001  00000001

Перевірити роботу скрипта на різних IP-адресах, наприклад: 192.168.100.1, 10.5.5.190.

Вивід має бути впорядкований як у прикладі:
* стовпцями
* ширина стовпця 10 символів (у двійковому форматі треба додати два пробіли між
  стовпцями для поділу октетів між собою)

"""
ip = input('Enter IP adress: ')
ip_octets = ip.split('.')
ip_int_octets = [int(i) for i in ip_octets]
octet_01, octet_02, octet_03, octet_04 = ip_int_octets

print(f'''
{octet_01:<8}  {octet_02:<8}  {octet_03:<8}  {octet_04:<8}
{octet_01:08b}  {octet_02:08b}  {octet_03:08b}  {octet_04:08b}''')